// Task-2-3-ru.c : Этот файл содержит функцию 'main'. Выполнение программы начинается и заканчивается здесь.
//

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <locale.h>
#include <stdlib.h>
#include <stdbool.h>

int main(int argc, char* args[])
{
    // Инициализация переменных
    int direction = 0;  // 0: направление неизвестно, 1: вверх, -1: вниз
    unsigned int changes = 0;    // Счетчик смен направления
    int new_direction = direction;  // Новое направление
    unsigned int prev, current; // номера этажей, где лифт останавливался
    bool b_done = false; // флаговая переменная условие выхода из цикла
    // Установка русской локали для терминала Windows 11
    system("chcp 65001 >nul");// 1-й способ. Выплнить внешнюю команду.
    setlocale(LC_ALL, "russian.65001"); // 2 - й способ. Вызов библиотечной функции.
    // Ввод данных
    printf("Введите номера этажей, на которых останавливался лифт.\r\n");
    printf("0 - конец ввода данных.\r\n");
    // Считываем первый этаж
    scanf("%u", &prev);
    b_done = (prev == 0);  // флаговая переменная условие выхода из цикла
    while (!b_done)
    {
        scanf("%u",&current);  // Вводим остальные этажи
        b_done = (current == 0);  // Выходим из цикла, если введен 0
        // Если этажи совпадают, направление не меняется,
        // просто пропускаем
        if (!b_done && current != prev)
        {
            // Определяем новое текущее направление
            // между prev и current
            new_direction = 1;
            if (current > prev)
            {
                new_direction = -1;
            }
        }
        // Если до этого направление уже было известно (не 0)
        // и оно не совпадает с новым направлением, значит произошла смена
        if (!b_done && direction != 0 && new_direction != direction)
        {
            changes += 1;
        }
        // Обновляем историю для следующего шага
        direction = new_direction;
        prev = current;
    }
    // Вывод информации на экран
    printf("Количество смен направления лифтом: %u\r\n", changes);
    // Задержка вывода на экран до нажатия клавиши "Ввод"
    getchar();
    getc(stdin);
    return 0;
}

// Запуск программы: Ctrl + F5 или меню «Отладка» > «Запустить без отладки»
// Отладка программы: F5 или меню «Отладка» > «Запустить отладку»
// Советы по началу работы:
// 1. Используйте окно «Обозреватель решений» для добавления/управления файлами
// 2. Используйте окно «Обозреватель команд» для подключения к системе контроля версий
// 3. Используйте окно «Вывод», чтобы просмотреть результаты сборки и другие сообщения
// 4. Используйте окно «Список ошибок», чтобы просмотреть ошибки
// 5. Перейдите в меню «Проект» > «Добавить новый элемент», чтобы создать новые файлы кода, 
//    или в меню «Проект» > «Добавить существующий элемент», чтобы добавить существующие файлы кода в проект